tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
# Search tool like grep, but optimized for programmers
brew "ack"
# Shell extension to jump to frequently used directories
brew "autojump"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# New way to see and navigate directory trees
brew "broot"
# Modern replacement for 'ls'
brew "exa"
# CLI tool for quick access to files and directories
brew "fasd"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# Distributed revision control system
brew "git", link: false
# GitHub Markdown previewer
brew "grip"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Mac App Store command-line interface
brew "mas"
# Modern programming language in the Lisp/Scheme family
brew "minimal-racket"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Tiny, lightning fast, feature-packed file manager
brew "nnn"
# File browser
brew "ranger"
# RC file (dotfile) management
brew "rcm"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Lisp installer and launcher for major environments
brew "roswell"
# Rust toolchain installer
brew "rustup-init"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Code-search similar to ack
brew "the_silver_searcher"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Access X11 clipboards from the command-line
brew "xclip"
# Application launcher and productivity software
cask "alfred"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# Git client focusing on productivity
cask "gitkraken"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# PDF reader and note-taking application
cask "skim"
# Open-source code editor
cask "visual-studio-code"
mas "Amphetamine", id: 937984704
mas "Battery Health 2", id: 1120214373
mas "Be Focused", id: 973134470
mas "Endel", id: 1484348796
mas "Evernote", id: 406056744
mas "Fantastical", id: 975937182
mas "Flycut", id: 442160987
mas "GarageBand", id: 682658836
mas "GeoGebra Classic 6", id: 1182481622
mas "GoodNotes", id: 1444383602
mas "Grammarly for Safari", id: 1462114288
mas "HandShaker", id: 1012930195
mas "iMovie", id: 408981434
mas "Jira", id: 1475897096
mas "Keynote", id: 409183694
mas "LispPad", id: 1258939760
mas "Microsoft Excel", id: 462058435
mas "Microsoft OneNote", id: 784801555
mas "Microsoft Outlook", id: 985367838
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft To Do", id: 1274495053
mas "Microsoft Word", id: 462054704
mas "Notability", id: 360593530
mas "Numbers", id: 409203825
mas "OneDrive", id: 823766827
mas "Pages", id: 409201541
mas "Save to Medium", id: 1485294824
mas "Slack", id: 803453959
mas "Spark", id: 1176895641
mas "Swiftify for Xcode", id: 1183412116
mas "Telegram", id: 747648890
mas "The Unarchiver", id: 425424353
mas "Todoist", id: 585829637
mas "Trello", id: 1278508951
mas "Vectornator Pro", id: 1470168007
mas "WhatsApp", id: 1147396723
mas "Xcode", id: 497799835
