tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
brew "ack"
brew "autojump"
brew "bat"
brew "broot"
brew "exa"
brew "fasd"
brew "fd"
brew "fzf"
brew "gcc"
brew "git", link: false
brew "grip"
brew "httpie"
brew "minimal-racket"
brew "neovim"
brew "nnn"
brew "ranger"
brew "rcm"
brew "ripgrep"
brew "roswell"
brew "rustup-init"
brew "shellcheck"
brew "the_silver_searcher"
brew "tldr"
brew "tmux"
brew "tree"
brew "xclip"
cask "alfred"
cask "db-browser-for-sqlite"
cask "dropbox"
cask "gitkraken"
cask "google-chrome"
cask "skim"
cask "visual-studio-code"
